RT-Thread/rt-thread/bsp/stm32/libraries/STM32H5xx_HAL/STM32H5xx_HAL_Driver/Inc/stm32h5xx_ll_adc.h
#define LL_ADC_AWD_CH_VREFINT_INJ          ((LL_ADC_CHANNEL_VREFINT    & ADC_CHANNEL_ID_MASK) \
                                            | ADC_CFGR_JAWD1EN | ADC_CFGR_AWD1SGL)   /*!< ADC analog watchdog monitoring
                                            of ADC internal channel connected to VrefInt: Internal voltage reference,
                                            converted by group injected only.
                                            On STM32H563xx/573xx, ADC channel available only on ADC instance: ADC1. */
#define LL_ADC_AWD_CH_VREFINT_REG_INJ      ((LL_ADC_CHANNEL_VREFINT    & ADC_CHANNEL_ID_MASK) \
                                            | ADC_CFGR_JAWD1EN | ADC_CFGR_AWD1EN \
                                            | ADC_CFGR_AWD1SGL)                      /*!< ADC analog watchdog monitoring
                                           of ADC internal channel connected to VrefInt: Internal voltage reference,
                                           converted by either group regular or injected.
                                           On STM32H563xx/573xx, ADC channel available only on ADC instance: ADC1. */
#define LL_ADC_AWD_CH_TEMPSENSOR_REG       ((LL_ADC_CHANNEL_TEMPSENSOR & ADC_CHANNEL_ID_MASK) \
                                            | ADC_CFGR_AWD1EN | ADC_CFGR_AWD1SGL)    /*!< ADC analog watchdog monitoring
                                           of ADC internal channel connected to internal temperature sensor,
                                           converted by group regular only.
                                           On STM32H563xx/573xx, ADC channel available only on ADC instance: ADC1. */
#define LL_ADC_AWD_CH_TEMPSENSOR_INJ       ((LL_ADC_CHANNEL_TEMPSENSOR & ADC_CHANNEL_ID_MASK) \
                                            | ADC_CFGR_JAWD1EN | ADC_CFGR_AWD1SGL)   /*!< ADC analog watchdog monitoring
                                           of ADC internal channel connected to internal temperature sensor,
                                           converted by group injected only.
                                           On STM32H563xx/573xx, ADC channel available only on ADC instance: ADC1. */
#define LL_ADC_AWD_CH_TEMPSENSOR_REG_INJ   ((LL_ADC_CHANNEL_TEMPSENSOR & ADC_CHANNEL_ID_MASK) \
                                            | ADC_CFGR_JAWD1EN | ADC_CFGR_AWD1EN \
                                            | ADC_CFGR_AWD1SGL)                      /*!< ADC analog watchdog monitoring
                                           of ADC internal channel connected to internal temperature sensor,
                                           converted by either group regular or injected.
                                           On STM32H563xx/573xx, ADC channel available only on ADC instance: ADC1. */
#define LL_ADC_AWD_CH_VBAT_REG             ((LL_ADC_CHANNEL_VBAT       & ADC_CHANNEL_ID_MASK) \
                                            | ADC_CFGR_AWD1EN | ADC_CFGR_AWD1SGL)    /*!< ADC analog watchdog monitoring
                                           of ADC internal channel connected to Vbat/4: Vbat voltage through
                                           a divider ladder of factor 1/4 to have channel voltage always below Vdda,
                                           converted by group regular only.
                                           On STM32H563xx/573xx, ADC channel available only on ADC instance: ADC2. */
#define LL_ADC_AWD_CH_VBAT_INJ             ((LL_ADC_CHANNEL_VBAT       & ADC_CHANNEL_ID_MASK) \
                                            | ADC_CFGR_JAWD1EN | ADC_CFGR_AWD1SGL)   /*!< ADC analog watchdog monitoring
                                           of ADC internal channel connected to Vbat/4: Vbat voltage through
                                           a divider ladder of factor 1/4 to have channel voltage always below Vdda,
                                           converted by group injected only.
                                           On STM32H563xx/573xx, ADC channel available only on ADC instance: ADC2. */
#define LL_ADC_AWD_CH_VBAT_REG_INJ         ((LL_ADC_CHANNEL_VBAT       & ADC_CHANNEL_ID_MASK) \
                                            | ADC_CFGR_JAWD1EN | ADC_CFGR_AWD1EN \
                                            | ADC_CFGR_AWD1SGL)                      /*!< ADC analog watchdog monitoring
                                           of ADC internal channel connected to Vbat/4: Vbat voltage through
                                           a divider ladder of factor 1/4 to have channel voltage always below Vdda.
                                           On STM32H563xx/573xx, ADC channel available only on ADC instance: ADC2. */
#define LL_ADC_AWD_CH_VDDCORE_REG          ((LL_ADC_CHANNEL_VDDCORE    & ADC_CHANNEL_ID_MASK) \
                                            | ADC_CFGR_AWD1EN | ADC_CFGR_AWD1SGL)    /*!< ADC analog watchdog monitoring
                                           of ADC internal channel connected to Vddcore, converted by group regular only
                                           On STM32H563xx/573xx, ADC channel available only on ADC instance: ADC2. */
#define LL_ADC_AWD_CH_VDDCORE_INJ          ((LL_ADC_CHANNEL_VDDCORE    & ADC_CHANNEL_ID_MASK) \
                                            | ADC_CFGR_JAWD1EN | ADC_CFGR_AWD1SGL)   /*!< ADC analog watchdog monitoring
                                           of ADC internal channel connected to Vddcore,
                                           converted by group injected only.
                                           On STM32H563xx/573xx, ADC channel available only on ADC instance: ADC2. */
#define LL_ADC_AWD_CH_VDDCORE_REG_INJ      ((LL_ADC_CHANNEL_VDDCORE    & ADC_CHANNEL_ID_MASK) \
                                            | ADC_CFGR_JAWD1EN | ADC_CFGR_AWD1EN \
                                            | ADC_CFGR_AWD1SGL)                      /*!< ADC analog watchdog monitoring
                                           of ADC internal channel connected to Vddcore,
                                           converted by either group regular or injected.
                                           On STM32H563xx/573xx, ADC channel available only on ADC instance: ADC2. */

